package com.backend.i18n;

import java.util.ListResourceBundle;

public class errorMessages_ru_RU extends ListResourceBundle {

    @Override
    protected Object[][] getContents() {
        return new Object[][] {
                {"1000", "Неизвестная ошибка сервера"},
                {"1001", "Доступ запрещен"},
                {"1002", "Запрашиваемый контент не найден"},
                {"1003", "Некорректные данные запроса"},
                {"2000", "Неверный email или пароль"},
                {"3000", "Пользователь с указанным email уже существует. Пожалуйста попробуйте другой email"},
                {"3001", "Неверный код подтверждения регистрации. Пожалуйста проверьте корректность введенного кода"},
                {"3002", "Время жизни кода подтверждения регистрации истекло. Пожалуйста повторите процесс регистрации"},
                {"4000", "Пользователь с указанным email уже существует. Пожалуйста попробуйте другой email"},
                {"4001", "Неверной код подтверждения смены email. Пожалуйста проверьте корректность введенного кода"},
                {"4002", "Время жизни кода подтверждения смены email истекло. Пожалуйста повторите процесс смены email"},
                {"5000", "Неверный код восстановления пароля. Пожалуйста проверьте корректность введенного кода"},
                {"5001", "Время жизни кода восстановления пароля истекло. Пожалуйста повторите процесс восстановления пароля"}
        };
    }
}
