package com.backend.i18n;

import java.util.ListResourceBundle;

public class errorMessages_ru_RU extends ListResourceBundle {

    @Override
    protected Object[][] getContents() {
        return new Object[][] {
                {"1000", "Неизвестная ошибка сервера"},
                {"1001", "Доступ запрещен"},
                {"1002", "Запрашиваемый контент не найден"},
                {"1003", "Некорректные данные запроса"},
                {"2000", "Неверный email или пароль"},
                {"3000", "Пользователь с указанным email уже существует. Попробуйте другой email"},
                {"3001", "Неверный код подтверждения регистрации. Проверьте корректность введенного кода"},
                {"3002", "Время жизни кода подтверждения регистрации истекло. Повторите процесс регистрации"},
                {"4000", "Пользователь с указанным email уже существует. Попробуйте другой email"},
                {"4001", "Неверной код подтверждения смены email. Проверьте корректность введенного кода"},
                {"4002", "Время жизни кода подтверждения смены email истекло. Повторите процесс смены email"}
        };
    }
}
